Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0005] In a 5th generation (5th generation, 5G) system and a future communications system, the foregoing service procedure may be extended, and the suspend and resume procedure is applied to an enhanced mobile broadband (enhanced mobile broadband, eMBB) terminal such as a smartphone.
de_de: [0005] In einem System der 5. Generation (5. Generation, 5G) und einem zukünftigen Kommunikationssystem kann die vorstehende Dienstprozedur erweitert werden, und die Aussetzungs- und Wiederaufnahmeprozedur wird auf ein Endgerät mit erweitertem mobilen Breitband (enhanced mobile broadband, eMBB), wie etwa ein Smartphone, angewendet.

source: [0006] Because mobility of the terminal is relatively high, a base station accessed by the terminal may change.
de_de: [0006] Da die Mobilität des Endgeräts relativ hoch ist, kann sich eine Basisstation, auf die durch das Endgerät zugegriffen wird, ändern.

source: Further, when serving the terminal, the base station considers a load balancing scenario.
de_de: Ferner betrachtet die Basisstation, wenn sie das Endgerät bedient, ein Lastausgleichsszenario.

source: For example, when the terminal requests to resume from the inactive state to the connected state, if load of a base station that the terminal currently intends to access is relatively heavy, the base station rejects access by the terminal, that is, rejects a connection resume request of the terminal, and indicates the terminal to try to resume the connection after resting for a period of time.
de_de: Wenn das Endgerät zum Beispiel anfordert, vo dem inaktiven Zustand in den verbundenen Zustand zurückzukehren, wenn die Last einer Basisstation, auf die das Endgerät gegenwärtig zugreifen will, relativ hoch ist, lehnt die Basisstation den Zugriff durch das Endgerät ab, das heißt, lehnt eine Verbindungswiederaufnahmeanforderung des Endgeräts ab und gibt dem Endgerät an, zu versuchen, die Verbindung nach dem Ruhen für einen Zeitraum wieder aufzunehmen.

source: [0007] In the foregoing scenario, after the connection resume request of the terminal is rejected firstly, authentication information sent by the terminal may be obtained by an attacker, and then the attacker requests, by using the obtained authentication information, the base station to establish a connection.
de_de: [0007] In dem vorstehenden Szenario können, nachdem die Verbindungswiederaufnahmeanforderung des Endgeräts zuerst abgelehnt wurde, Authentifizierungsinformationen, die durch das Endgerät gesendet wurden, durch einen Angreifer erhalten werden, und dann fordert der Angreifer unter Verwendung der erhaltenen Authentifizierungsinformationen die Basisstation an, eine Verbindung herzustellen.

source: Further, an attack may be caused.
de_de: Ferner kann ein Angriff verursacht werden.

source: [0008] Therefore, in the foregoing scenario, how to effectively defend against an attack of the attacker is a problem that urgently needs to be resolved.
de_de: [0008] Daher ist das Problem in dem vorstehenden Szenario, wie man effektiv gegen einen Angriff des Angreifers verteidigt, ein Problem, das dringend gelöst werden muss.

source: WO 2017/048170 A1 discloses a method of key deriving between a UE and a resuming eNB.
de_de: Die WO 2017/048170 A1 offenbart ein Verfahren zur Schlüsselableitung zwischen einem UE und einem wiederaufnehmenden eNB.

source: It discusses the technical problem that if a type of key derivation has not been agreed beforehand between the UE and the suspending eNB, the suspending eNB may provide different base key to the resuming eNB.
de_de: Es wird das technische Problem diskutiert, dass, wenn eine Art von Schlüsselableitung nicht im Voraus zwischen dem UE und dem suspendierenden eNB vereinbart wurde, der suspendierende eNB dem wiederaufnehmenden eNB einen anderen Basisschlüssel bereitstellen kann.

source: 3GPP TS 33.401 V15.1.0 discloses security architecture and procedures for the LTE System.
de_de: 3GPP TS 33,401 V15.1.0 offenbart eine Sicherheitsarchitektur und Prozeduren für das LTE-System.

source: Sections 7.2.11.3, 7.2.11.4 and 7.4.3 disclose a procedure of RRC connection resume to a new eNB.
de_de: Die Abschnitte 7.2.11.3, 7.2.11.4 und 7.4.3 offenbaren eine Prozedur der RRC-Verbindungswiederaufnahme zu einem neuen eNB.

source: SUMMARY
de_de: ZUSAMMENFASSUNG

source: [0009] This application provides a connection resume request method and an apparatus, to effectively defend against an attack of an attacker.
de_de: [0009] Diese Anmeldung stellt ein Verbindungswiederaufnahmeanforderungsverfahren und eine Vorrichtung bereit, um sich effektiv gegen einen Angriff eines Angreifers zu verteidigen.

source: The foregoing object is achieved by the features of the independent claims.
de_de: Die vorstehende Aufgabe wird durch die Merkmale der unabhängigen Ansprüche gelöst.

source: Additional features of the invention are presented in the dependent claims.
de_de: Weitere Merkmale der Erfindung sind in den abhängigen Ansprüchen dargestellt.

source: In the following, parts of the description and drawings referring to embodiments, which are not covered by the claims are not presented as embodiments of the invention, but as examples useful for understanding the invention.
de_de: Im Folgenden werden Teile der Beschreibung und der Zeichnungen, die sich auf Ausführungsformen beziehen, die nicht durch die Ansprüche abgedeckt sind, nicht als Ausführungsformen der Erfindung dargestellt, sondern als Beispiele, die zum Verständnis der Erfindung nützlich sind.

source: [0010] According to a first aspect, this application provides a connection resume request method, including: generating, by a terminal, a message authentication code based on a freshness parameter and an integrity protection key that is of the terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and sending, by the terminal, a connection resume request message to a target base station, where the connection resume request message includes the message authentication code, and the connection resume request message is used to request to resume a radio resource control RRC connection.
de_de: [0010] Gemäß einem ersten Aspekt stellt diese Anmeldung ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes beinhaltet: Erzeugen, durch ein Endgerät, eines Nachrichtenauthentifizierungscodes basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel, der von dem Endgerät stammt, wobei Aktualitätsparameter, die zum Erzeugen von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, unterschiedlich sind; und Senden, durch das Endgerät, einer Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation, wobei die Verbindungswiederaufnahmeanforderungsnachricht den Nachrichtenauthentifizierungscode beinhaltet und die Verbindungswiederaufnahmeanforderungsnachricht verwendet wird, um die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern.

source: [0011] A message authentication code generated by the terminal each time is different from a message authentication code generated at a previous time.
de_de: [0011] Ein Nachrichtenauthentifizierungscode, der jedes Mal durch das Endgerät erzeugt wird, unterscheidet sich von einem Nachrichtenauthentifizierungscode, der zu einem vorherigen Zeitpunkt erzeugt wurde.

source: Therefore, even if an attacker steals the message authentication code that is used by the terminal at the previous time, the attacker cannot succeed in the attack because the "expired" message authentication code is used.
de_de: Daher kann der Angreifer, selbst wenn ein Angreifer den Nachrichtenauthentifizierungscode stiehlt, der durch das Endgerät zum vorherigen Mal verwendet wird, den Angriff nicht erfolgreich durchführen, da der „abgelaufene“ Nachrichtenauthentifizierungscode verwendet wird.

source: [0012] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected.
de_de: [0012] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um eine Menge von Zeiten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät durchzuführen versucht, abgelehnt wird.

source: In a possible implementation, the connection resume request message further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: Bei einer möglichen Implementierung beinhaltet die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, und der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzugeben.

source: [0013] In an example, the freshness parameter includes a packet data convergence protocol count (PDCP count), and the indication parameter includes some or all bits of the PDCP count.
de_de: [0013] In einem Beispiel beinhaltet der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (PDCP-Zählung), und der Anzeigeparameter beinhaltet einige oder alle Bits der PDCP-Zählung.

source: [0014] In a possible implementation, the terminal receives a connection resume response message from the target base station, where the connection resume response message is used to instruct the terminal to resume the RRC connection.
de_de: [0014] Bei einer möglichen Implementierung empfängt das Endgerät eine Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation, wobei die Verbindungswiederaufnahmeantwortnachricht verwendet wird, um das Endgerät anzuweisen, die RRC-Verbindung wieder aufzunehmen.

source: [0015] According to a second aspect, this application provides a connection resume request method, including: receiving, by a target base station, a connection resume request message from a terminal, where the connection resume request message includes a message authentication code, the connection resume request message is used to request to resume a radio resource control RRC connection, and the message authentication code is generated based on an integrity protection key of the terminal; and sending, by the target base station, a notification message to a source base station if rejecting resuming of the RRC connection, where the notification message includes the message authentication code.
de_de: [0015] Gemäß einem zweiten Aspekt stellt diese Anmeldung ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes beinhaltet: Empfangen, durch eine Zielbasisstation, einer Verbindungswiederaufnahmeanforderungsnachricht von einem Endgerät, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode beinhaltet, die Verbindungswiederaufnahmeanforderungsnachricht verwendet wird, um die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern, und der Nachrichtenauthentifizierungscode basierend auf einem Integritätsschutzschlüssel des Endgeräts erzeugt wird; und Senden, durch die Zielbasisstation, einer Benachrichtigungsnachricht an eine Quellbasisstation, wenn die Wiederaufnahme der RRC-Verbindung abgelehnt wird, wobei die Benachrichtigungsnachricht den Nachrichtenauthentifizierungscode beinhaltet.

source: [0016] The notification message has one or more of the following functions:
de_de: [0016] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: the notification message is used to instruct to update a context of the terminal in the source base station;
de_de: die Benachrichtigungsnachricht wird verwendet, um anzuweisen, einen Kontext des Endgeräts in der Quellbasisstation zu aktualisieren;

source: the notification message is used to notify that the target base station rejects resuming of the connection that is performed by the terminal;
de_de: die Benachrichtigungsnachricht wird verwendet, um zu benachrichtigen, dass die Zielbasisstation die Verbindungswiederaufnahme, die durch das Endgerät durchgeführt wird, ablehnt;

source: the notification message is used to instruct to update a freshness parameter in the context of the terminal in the source base station; and
de_de: die Benachrichtigungsnachricht wird verwendet, um anzuweisen, einen Aktualitätsparameter im Kontext des Endgeräts in der Quellbasisstation zu aktualisieren; und

source: the notification message is used to instruct to update a key in the context of the terminal in the source base station.
de_de: die Benachrichtigungsnachricht wird verwendet, um anzuweisen, einen Schlüssel im Kontext des Endgeräts in der Quellbasisstation zu aktualisieren.

source: [0017] According to the foregoing method, when rejecting resuming of the RRC connection, the target base station further instructs the source base station to update the context of the terminal, so that context consistency can be maintained between the terminal and the source base station.
de_de: [0017] Gemäß dem vorstehenden Verfahren weist die Zielbasisstation, wenn sie die Wiederaufnahme der RRC-Verbindung ablehnt, ferner die Quellbasisstation an, den Kontext des Endgeräts zu aktualisieren, so dass die Kontextkonsistenz zwischen dem Endgerät und der Quellbasisstation aufrechterhalten werden kann.

source: This helps reduce a failure probability of entering a connected state by the terminal from an inactive state.
de_de: Dies trägt dazu bei, eine Ausfallwahrscheinlichkeit des Eintretens in einen verbundenen Zustand durch das Endgerät aus einem inaktiven Zustand zu verringern.

source: [0018] In a possible implementation, the context of the terminal that the notification message instructs to update includes an access stratum key.
de_de: [0018] Bei einer möglichen Implementierung enthält der Kontext des Endgeräts, den die Benachrichtigungsnachricht anweist, zu aktualisieren, einen Zugriffsschichtschlüssel.

source: [0019] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected.
de_de: [0019] Bei einer möglichen Implementierung enthält der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um eine Anzahl von Zeiten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät durchzuführen versucht, abgelehnt ist.

source: [0020] In a possible implementation, the message authentication code is generated based on the freshness parameter and the integrity protection key that is of the terminal, and the context of the terminal that the notification message instructs to update includes the freshness parameter, where freshness parameters used to generate message authentication codes at two consecutive times are different.
de_de: [0020] Bei einer möglichen Implementierung wird der Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter und dem Integritätsschutzschlüssel, der von dem Endgerät ist, erzeugt, und der Kontext des Endgeräts, den die Benachrichtigungsnachricht anweist, zu aktualisieren, enthält den Aktualitätsparameter, wobei Aktualitätsparameter, die verwendet werden, um Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeiten zu erzeugen, unterschiedlich sind.

source: [0021] In this implementation, the connection resume request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the notification message further includes the indication parameter.
de_de: [0021] In dieser Implementierung enthält die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, wobei der Anzeigeparameter verwendet wird, um den Aktualitätsparameter anzuzeigen, und die Benachrichtigungsnachricht enthält ferner den Anzeigeparameter.

source: In an example, the freshness parameter includes a PDCP count, and the indication parameter includes some or all bits of the PDCP count.
de_de: In einem Beispiel enthält der Aktualitätsparameter eine PDCP-Zählung und der Anzeigeparameter enthält einige oder alle Bits der PDCP-Zählung.

source: [0022] According to a third aspect, this application provides a connection resume request method, including: receiving, by a target base station, a connection resume request message from a terminal, where the connection resume request message includes a message authentication code; the message authentication code is generated based on a freshness parameter and an integrity protection key that is of the terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and the connection resume request message is used to request to resume a radio resource control RRC connection; and sending, by the target base station, a context request message to a source base station if accepting the resuming of the RRC connection, where the context request message includes the message authentication code, and the context request message is used to request to obtain a context of the terminal.
de_de: [0022] Gemäß einem dritten Aspekt stellt diese Anmeldung ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes enthält: Empfangen, durch eine Zielbasisstation, einer Verbindungswiederaufnahmeanforderungsnachricht von einem Endgerät, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode enthält; der Nachrichtenauthentifizierungscode wird basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel, der von dem Endgerät ist, erzeugt, wobei Aktualitätsparameter, die verwendet werden, um Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten zu erzeugen, unterschiedlich sind; und die Verbindungswiederaufnahmeanforderungsnachricht wird verwendet, um die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern; und Senden, durch die Zielbasisstation, einer Kontextanforderungsnachricht an eine Quellbasisstation, wenn die Wiederaufnahme der RRC-Verbindung akzeptiert wird, wobei die Kontextanforderungsnachricht den Nachrichtenauthentifizierungscode enthält und die Kontextanforderungsnachricht verwendet wird, um anzufordern, einen Kontext des Endgeräts zu erhalten.

source: [0023] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected.
de_de: [0023] Bei einer möglichen Implementierung enthält der Aktualitätsparameter eine Anzahl von Ablehnungszeitpunkten und die Anzahl von Ablehnungszeitpunkten wird verwendet, um eine Menge von Zeitpunkten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät auszuführen versucht, abgelehnt wird.

source: [0024] In a possible implementation, the connection resume request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the context request message further includes the indication parameter.
de_de: [0024] Bei einer möglichen Implementierung enthält die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzugeben, und die Kontextanforderungsnachricht enthält ferner den Anzeigeparameter.

source: [0025] In an example, the freshness parameter includes a packet data convergence protocol (PDCP) count, and the indication parameter includes some or all bits of the PDCP count.
de_de: [0025] In einem Beispiel enthält der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (PDCP-Zählung) und der Anzeigeparameter enthält einige oder alle Bits der PDCP-Zählung.

source: [0026] According to a fourth aspect, this application provides a connection resume request method, including: receiving, by a source base station, a notification message from a target base station, where the notification message includes a message authentication code, and the message authentication code is generated based on an integrity protection key of a terminal;
de_de: [0026] Gemäß einem vierten Aspekt stellt diese Anmeldung ein Verbindungswiederaufnahmeanforderungsverfahren bereit, das Folgendes enthält: Empfangen einer Benachrichtigungsnachricht von einer Zielbasisstation durch eine Quellbasisstation, wobei die Benachrichtigungsnachricht einen Nachrichtenauthentifizierungscode enthält und der Nachrichtenauthentifizierungscode basierend auf einem Integritätsschutzschlüssel eines Endgeräts erzeugt wird;

source: checking, by the source base station, the message authentication code based on an integrity protection key of the source base station; and
de_de: Prüfen des Nachrichtenauthentifizierungscodes durch die Quellbasisstation basierend auf einem Integritätsschutzschlüssel der Quellbasisstation; und

source: updating, by the source base station, a context of the terminal in the source base station if checking the message authentication code to be successful.
de_de: Aktualisieren eines Kontexts des Endgeräts in der Quellbasisstation durch die Quellbasisstation, wenn geprüft wird, dass der Nachrichtenauthentifizierungscode erfolgreich ist.

source: [0027] According to the foregoing method, when rejecting resuming of an RRC connection, the target base station further instructs the source base station to update the context of the terminal, so that the source base station updates the context of the terminal. Therefore, context consistency can be maintained between the source base station and the terminal. This helps reduce a failure probability of entering a connected state by the terminal from an inactive state.
de_de: [0027] Gemäß dem vorstehenden Verfahren weist die Zielbasisstation beim Ablehnen der Wiederaufnahme einer RRC-Verbindung ferner die Quellbasisstation an, den Kontext des Endgeräts zu aktualisieren, so dass die Quellbasisstation den Kontext des Endgeräts aktualisiert. Daher kann eine Kontextkonsistenz zwischen der Quellbasisstation und dem Endgerät aufrechterhalten werden. Dies trägt dazu bei, eine Ausfallwahrscheinlichkeit des Eintretens in einen verbundenen Zustand durch das Endgerät aus einem inaktiven Zustand zu verringern.

source: [0028] The notification message has one or more of the following functions:
de_de: [0028] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: the notification message is used to instruct to update the context of the terminal in the source base station;
de_de: die Benachrichtigungsnachricht wird verwendet, um anzuweisen, den Kontext des Endgeräts in der Quellbasisstation zu aktualisieren;

source: [0029] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the terminal attempts to perform is rejected.
de_de: [0029] Bei einer möglichen Implementierung enthält der Aktualitätsparameter eine Anzahl von Ablehnungszeitpunkten und die Anzahl von Ablehnungszeitpunkten wird verwendet, um eine Menge von Zeitpunkten anzugeben, für die die Wiederaufnahme der RRC-Verbindung, die das Endgerät auszuführen versucht, abgelehnt wird.
